[
  {
    "companyName": "Shift Commerce", 
    "position": "Web Developer", 
    "dates": "August 2018 - Present",
    "link": "https://www.shiftcommerce.com/",
    "text": [
      "Currently, in my role at Shift Commerce I am part of the team who works on our company's major client e-commerce website, where we push to be preformance first e-commerce website using mulitple technologies such as Ruby on Rails, ES6, SCSS and Lamda Functions, to push their e-commerce website further and increase their revenue from their website.",
      "During this time I have worked on multiple large projects for the client, such as integrating a product review api, giftcards and product wishlist, while also working on UX improvements, upgrading the test suite, building new components for the client to use, improving performance and connecting the api to the frontend.",
      "I have gained and push many of my skills by working in agile scrum, communicating with the client, planning sprints, performing demos of new features to the client and assisted in leading a team."
    ]
  },
  {
    "companyName": "SportsShoes", 
    "position": "Front End Developer", 
    "dates": "Feburary 2018 - August 2018",
    "link": "https://www.sportsshoes.com/",
    "text": [
      "While at Sportshoes.com my responsibilities included building new brand store pages for their several clients and updated multiple parts of the website, based on the designs and specifications given by the design team.",
      "Other responsibilities in the position include updating and adding new features such as content sliders, banner images, videos, interactive elements and page translation to other languages, while also pushing to bring the site to current web standards and improve the overall website performance."
    ]
  },
  {
    "companyName": "Networx Recruitment", 
    "position": "Digital Designer / Developer", 
    "dates": "April 2016 - December 2017",
    "link": "https://www.networxrecruitment.com/",
    "text": [
      "During my time at Networx Recruitment, I was responsible for desigin and building their recruitment system, such as their careers page both custom and template, job adverts, onboarding sites candidate experience branding and admin panel, to match the client business brand. I also helped run Housing Jobs' social media pages, set up social media apps for clients' twitter and facebook pages.",
      "One of the major development I did during my position at Networx Recruitment is to allow the all clients onboarding sites to work on multiple devices, allowing candidates to access their onboarding information and documents from any device."
    ]
  }
]